# RbsElecAnalyticalLoadNameParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecAnalyticalLoadNameParam Property
ParameterTypeId Class See Also
---
"Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecAnalyticalLoadNameParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecAnalyticalLoadNameParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecAnalyticalLoadNameParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace